[Ability.A_GiftOfLife_conf H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔法镜像"
mTooltip="该生物复制战斗中盟友和敌方英雄施放的所有正面法术。法术总是至少以专家级别被复制。"

[Ability.A_magic_abs_buff H7BaseBuff]
mName=""
mTooltip=""

[Ability.A_magic_abs_ennemie_buff H7BaseBuff]
mName=""
mTooltip=""

[Ability.A_MagicAbsorption_Buff_Marker_conf H7BaseBuff]
mName=""
mTooltip=""

[Ability.A_MagicAbsorption_conf H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔法强化"
mTooltip="从敌方生物攻击收到的所有魔法伤害都会为该生物的下一次攻击增加 %ICON_PRIME 源力伤害。\n此额外伤害受敌方生物队伍的最大基础伤害限制。"

[Ability.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔法爆炸"
mTooltip="该生物可以吸收、储存然后释放用于攻击它的魔法能量。它对目标造成随机魔法元素的 %d 伤害。（伤害每次该生物受到魔法伤害时增加。）\n攻击执行后，所有储存的能量被消耗并可以重新充能。"

[Creatures.A_Creature_Salamander_conf H7Creature]
mName="精灵龙"
mLore="精灵龙看似可爱，但实际上是淘气的骗子。对这些臭名昭著的麻烦制造者知之甚少。已知的信息更多出现在故事书中而非魔法典籍里。有人说它们是隐形的。有人说它们能施放强大的法术。有人说吸收或反射魔法能量是它们的能力之一。\n\n招募所需稀有资源： \n5 影钢"